Revit 2027 API
Noise.NoiseLevels Property
 The property labeled "Levels" from the "Noise" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string NoiseLevels { get; }
Public Shared ReadOnly Property NoiseLevels As String
	Get
public:
static property String^ NoiseLevels {
	String^ get ();
}
static member NoiseLevels : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble" within the range of "1, 10".
See Also
Reference
Noise Class
Autodesk.Revit.DB.Visual Namespace